Device: cuda
Train size: 1504
Test size: 188
Val size: 188
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 24, 128, 128]             648
       BatchNorm2d-2         [-1, 24, 128, 128]              48
              SiLU-3         [-1, 24, 128, 128]               0
            Conv2d-4         [-1, 24, 128, 128]           5,184
       BatchNorm2d-5         [-1, 24, 128, 128]              48
              SiLU-6         [-1, 24, 128, 128]               0
   StochasticDepth-7         [-1, 24, 128, 128]               0
       FusedMBConv-8         [-1, 24, 128, 128]               0
            Conv2d-9         [-1, 24, 128, 128]           5,184
      BatchNorm2d-10         [-1, 24, 128, 128]              48
             SiLU-11         [-1, 24, 128, 128]               0
  StochasticDepth-12         [-1, 24, 128, 128]               0
      FusedMBConv-13         [-1, 24, 128, 128]               0
           Conv2d-14           [-1, 96, 64, 64]          20,736
      BatchNorm2d-15           [-1, 96, 64, 64]             192
             SiLU-16           [-1, 96, 64, 64]               0
           Conv2d-17           [-1, 48, 64, 64]           4,608
      BatchNorm2d-18           [-1, 48, 64, 64]              96
      FusedMBConv-19           [-1, 48, 64, 64]               0
           Conv2d-20          [-1, 192, 64, 64]          82,944
      BatchNorm2d-21          [-1, 192, 64, 64]             384
             SiLU-22          [-1, 192, 64, 64]               0
           Conv2d-23           [-1, 48, 64, 64]           9,216
      BatchNorm2d-24           [-1, 48, 64, 64]              96
  StochasticDepth-25           [-1, 48, 64, 64]               0
      FusedMBConv-26           [-1, 48, 64, 64]               0
           Conv2d-27          [-1, 192, 64, 64]          82,944
      BatchNorm2d-28          [-1, 192, 64, 64]             384
             SiLU-29          [-1, 192, 64, 64]               0
           Conv2d-30           [-1, 48, 64, 64]           9,216
      BatchNorm2d-31           [-1, 48, 64, 64]              96
  StochasticDepth-32           [-1, 48, 64, 64]               0
      FusedMBConv-33           [-1, 48, 64, 64]               0
           Conv2d-34          [-1, 192, 64, 64]          82,944
      BatchNorm2d-35          [-1, 192, 64, 64]             384
             SiLU-36          [-1, 192, 64, 64]               0
           Conv2d-37           [-1, 48, 64, 64]           9,216
      BatchNorm2d-38           [-1, 48, 64, 64]              96
  StochasticDepth-39           [-1, 48, 64, 64]               0
      FusedMBConv-40           [-1, 48, 64, 64]               0
           Conv2d-41          [-1, 192, 32, 32]          82,944
      BatchNorm2d-42          [-1, 192, 32, 32]             384
             SiLU-43          [-1, 192, 32, 32]               0
           Conv2d-44           [-1, 64, 32, 32]          12,288
      BatchNorm2d-45           [-1, 64, 32, 32]             128
      FusedMBConv-46           [-1, 64, 32, 32]               0
           Conv2d-47          [-1, 256, 32, 32]         147,456
      BatchNorm2d-48          [-1, 256, 32, 32]             512
             SiLU-49          [-1, 256, 32, 32]               0
           Conv2d-50           [-1, 64, 32, 32]          16,384
      BatchNorm2d-51           [-1, 64, 32, 32]             128
  StochasticDepth-52           [-1, 64, 32, 32]               0
      FusedMBConv-53           [-1, 64, 32, 32]               0
           Conv2d-54          [-1, 256, 32, 32]         147,456
      BatchNorm2d-55          [-1, 256, 32, 32]             512
             SiLU-56          [-1, 256, 32, 32]               0
           Conv2d-57           [-1, 64, 32, 32]          16,384
      BatchNorm2d-58           [-1, 64, 32, 32]             128
  StochasticDepth-59           [-1, 64, 32, 32]               0
      FusedMBConv-60           [-1, 64, 32, 32]               0
           Conv2d-61          [-1, 256, 32, 32]         147,456
      BatchNorm2d-62          [-1, 256, 32, 32]             512
             SiLU-63          [-1, 256, 32, 32]               0
           Conv2d-64           [-1, 64, 32, 32]          16,384
      BatchNorm2d-65           [-1, 64, 32, 32]             128
  StochasticDepth-66           [-1, 64, 32, 32]               0
      FusedMBConv-67           [-1, 64, 32, 32]               0
           Conv2d-68          [-1, 256, 32, 32]          16,384
      BatchNorm2d-69          [-1, 256, 32, 32]             512
             SiLU-70          [-1, 256, 32, 32]               0
           Conv2d-71          [-1, 256, 16, 16]           2,304
      BatchNorm2d-72          [-1, 256, 16, 16]             512
             SiLU-73          [-1, 256, 16, 16]               0
AdaptiveAvgPool2d-74            [-1, 256, 1, 1]               0
           Conv2d-75             [-1, 16, 1, 1]           4,112
             SiLU-76             [-1, 16, 1, 1]               0
           Conv2d-77            [-1, 256, 1, 1]           4,352
          Sigmoid-78            [-1, 256, 1, 1]               0
SqueezeExcitation-79          [-1, 256, 16, 16]               0
           Conv2d-80          [-1, 128, 16, 16]          32,768
      BatchNorm2d-81          [-1, 128, 16, 16]             256
           MBConv-82          [-1, 128, 16, 16]               0
           Conv2d-83          [-1, 512, 16, 16]          65,536
      BatchNorm2d-84          [-1, 512, 16, 16]           1,024
             SiLU-85          [-1, 512, 16, 16]               0
           Conv2d-86          [-1, 512, 16, 16]           4,608
      BatchNorm2d-87          [-1, 512, 16, 16]           1,024
             SiLU-88          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-89            [-1, 512, 1, 1]               0
           Conv2d-90             [-1, 32, 1, 1]          16,416
             SiLU-91             [-1, 32, 1, 1]               0
           Conv2d-92            [-1, 512, 1, 1]          16,896
          Sigmoid-93            [-1, 512, 1, 1]               0
SqueezeExcitation-94          [-1, 512, 16, 16]               0
           Conv2d-95          [-1, 128, 16, 16]          65,536
      BatchNorm2d-96          [-1, 128, 16, 16]             256
  StochasticDepth-97          [-1, 128, 16, 16]               0
           MBConv-98          [-1, 128, 16, 16]               0
           Conv2d-99          [-1, 512, 16, 16]          65,536
     BatchNorm2d-100          [-1, 512, 16, 16]           1,024
            SiLU-101          [-1, 512, 16, 16]               0
          Conv2d-102          [-1, 512, 16, 16]           4,608
     BatchNorm2d-103          [-1, 512, 16, 16]           1,024
            SiLU-104          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-105            [-1, 512, 1, 1]               0
          Conv2d-106             [-1, 32, 1, 1]          16,416
            SiLU-107             [-1, 32, 1, 1]               0
          Conv2d-108            [-1, 512, 1, 1]          16,896
         Sigmoid-109            [-1, 512, 1, 1]               0
SqueezeExcitation-110          [-1, 512, 16, 16]               0
          Conv2d-111          [-1, 128, 16, 16]          65,536
     BatchNorm2d-112          [-1, 128, 16, 16]             256
 StochasticDepth-113          [-1, 128, 16, 16]               0
          MBConv-114          [-1, 128, 16, 16]               0
          Conv2d-115          [-1, 512, 16, 16]          65,536
     BatchNorm2d-116          [-1, 512, 16, 16]           1,024
            SiLU-117          [-1, 512, 16, 16]               0
          Conv2d-118          [-1, 512, 16, 16]           4,608
     BatchNorm2d-119          [-1, 512, 16, 16]           1,024
            SiLU-120          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-121            [-1, 512, 1, 1]               0
          Conv2d-122             [-1, 32, 1, 1]          16,416
            SiLU-123             [-1, 32, 1, 1]               0
          Conv2d-124            [-1, 512, 1, 1]          16,896
         Sigmoid-125            [-1, 512, 1, 1]               0
SqueezeExcitation-126          [-1, 512, 16, 16]               0
          Conv2d-127          [-1, 128, 16, 16]          65,536
     BatchNorm2d-128          [-1, 128, 16, 16]             256
 StochasticDepth-129          [-1, 128, 16, 16]               0
          MBConv-130          [-1, 128, 16, 16]               0
          Conv2d-131          [-1, 512, 16, 16]          65,536
     BatchNorm2d-132          [-1, 512, 16, 16]           1,024
            SiLU-133          [-1, 512, 16, 16]               0
          Conv2d-134          [-1, 512, 16, 16]           4,608
     BatchNorm2d-135          [-1, 512, 16, 16]           1,024
            SiLU-136          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-137            [-1, 512, 1, 1]               0
          Conv2d-138             [-1, 32, 1, 1]          16,416
            SiLU-139             [-1, 32, 1, 1]               0
          Conv2d-140            [-1, 512, 1, 1]          16,896
         Sigmoid-141            [-1, 512, 1, 1]               0
SqueezeExcitation-142          [-1, 512, 16, 16]               0
          Conv2d-143          [-1, 128, 16, 16]          65,536
     BatchNorm2d-144          [-1, 128, 16, 16]             256
 StochasticDepth-145          [-1, 128, 16, 16]               0
          MBConv-146          [-1, 128, 16, 16]               0
          Conv2d-147          [-1, 512, 16, 16]          65,536
     BatchNorm2d-148          [-1, 512, 16, 16]           1,024
            SiLU-149          [-1, 512, 16, 16]               0
          Conv2d-150          [-1, 512, 16, 16]           4,608
     BatchNorm2d-151          [-1, 512, 16, 16]           1,024
            SiLU-152          [-1, 512, 16, 16]               0
AdaptiveAvgPool2d-153            [-1, 512, 1, 1]               0
          Conv2d-154             [-1, 32, 1, 1]          16,416
            SiLU-155             [-1, 32, 1, 1]               0
          Conv2d-156            [-1, 512, 1, 1]          16,896
         Sigmoid-157            [-1, 512, 1, 1]               0
SqueezeExcitation-158          [-1, 512, 16, 16]               0
          Conv2d-159          [-1, 128, 16, 16]          65,536
     BatchNorm2d-160          [-1, 128, 16, 16]             256
 StochasticDepth-161          [-1, 128, 16, 16]               0
          MBConv-162          [-1, 128, 16, 16]               0
          Conv2d-163          [-1, 768, 16, 16]          98,304
     BatchNorm2d-164          [-1, 768, 16, 16]           1,536
            SiLU-165          [-1, 768, 16, 16]               0
          Conv2d-166          [-1, 768, 16, 16]           6,912
     BatchNorm2d-167          [-1, 768, 16, 16]           1,536
            SiLU-168          [-1, 768, 16, 16]               0
AdaptiveAvgPool2d-169            [-1, 768, 1, 1]               0
          Conv2d-170             [-1, 32, 1, 1]          24,608
            SiLU-171             [-1, 32, 1, 1]               0
          Conv2d-172            [-1, 768, 1, 1]          25,344
         Sigmoid-173            [-1, 768, 1, 1]               0
SqueezeExcitation-174          [-1, 768, 16, 16]               0
          Conv2d-175          [-1, 160, 16, 16]         122,880
     BatchNorm2d-176          [-1, 160, 16, 16]             320
          MBConv-177          [-1, 160, 16, 16]               0
          Conv2d-178          [-1, 960, 16, 16]         153,600
     BatchNorm2d-179          [-1, 960, 16, 16]           1,920
            SiLU-180          [-1, 960, 16, 16]               0
          Conv2d-181          [-1, 960, 16, 16]           8,640
     BatchNorm2d-182          [-1, 960, 16, 16]           1,920
            SiLU-183          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-184            [-1, 960, 1, 1]               0
          Conv2d-185             [-1, 40, 1, 1]          38,440
            SiLU-186             [-1, 40, 1, 1]               0
          Conv2d-187            [-1, 960, 1, 1]          39,360
         Sigmoid-188            [-1, 960, 1, 1]               0
SqueezeExcitation-189          [-1, 960, 16, 16]               0
          Conv2d-190          [-1, 160, 16, 16]         153,600
     BatchNorm2d-191          [-1, 160, 16, 16]             320
 StochasticDepth-192          [-1, 160, 16, 16]               0
          MBConv-193          [-1, 160, 16, 16]               0
          Conv2d-194          [-1, 960, 16, 16]         153,600
     BatchNorm2d-195          [-1, 960, 16, 16]           1,920
            SiLU-196          [-1, 960, 16, 16]               0
          Conv2d-197          [-1, 960, 16, 16]           8,640
     BatchNorm2d-198          [-1, 960, 16, 16]           1,920
            SiLU-199          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-200            [-1, 960, 1, 1]               0
          Conv2d-201             [-1, 40, 1, 1]          38,440
            SiLU-202             [-1, 40, 1, 1]               0
          Conv2d-203            [-1, 960, 1, 1]          39,360
         Sigmoid-204            [-1, 960, 1, 1]               0
SqueezeExcitation-205          [-1, 960, 16, 16]               0
          Conv2d-206          [-1, 160, 16, 16]         153,600
     BatchNorm2d-207          [-1, 160, 16, 16]             320
 StochasticDepth-208          [-1, 160, 16, 16]               0
          MBConv-209          [-1, 160, 16, 16]               0
          Conv2d-210          [-1, 960, 16, 16]         153,600
     BatchNorm2d-211          [-1, 960, 16, 16]           1,920
            SiLU-212          [-1, 960, 16, 16]               0
          Conv2d-213          [-1, 960, 16, 16]           8,640
     BatchNorm2d-214          [-1, 960, 16, 16]           1,920
            SiLU-215          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-216            [-1, 960, 1, 1]               0
          Conv2d-217             [-1, 40, 1, 1]          38,440
            SiLU-218             [-1, 40, 1, 1]               0
          Conv2d-219            [-1, 960, 1, 1]          39,360
         Sigmoid-220            [-1, 960, 1, 1]               0
SqueezeExcitation-221          [-1, 960, 16, 16]               0
          Conv2d-222          [-1, 160, 16, 16]         153,600
     BatchNorm2d-223          [-1, 160, 16, 16]             320
 StochasticDepth-224          [-1, 160, 16, 16]               0
          MBConv-225          [-1, 160, 16, 16]               0
          Conv2d-226          [-1, 960, 16, 16]         153,600
     BatchNorm2d-227          [-1, 960, 16, 16]           1,920
            SiLU-228          [-1, 960, 16, 16]               0
          Conv2d-229          [-1, 960, 16, 16]           8,640
     BatchNorm2d-230          [-1, 960, 16, 16]           1,920
            SiLU-231          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-232            [-1, 960, 1, 1]               0
          Conv2d-233             [-1, 40, 1, 1]          38,440
            SiLU-234             [-1, 40, 1, 1]               0
          Conv2d-235            [-1, 960, 1, 1]          39,360
         Sigmoid-236            [-1, 960, 1, 1]               0
SqueezeExcitation-237          [-1, 960, 16, 16]               0
          Conv2d-238          [-1, 160, 16, 16]         153,600
     BatchNorm2d-239          [-1, 160, 16, 16]             320
 StochasticDepth-240          [-1, 160, 16, 16]               0
          MBConv-241          [-1, 160, 16, 16]               0
          Conv2d-242          [-1, 960, 16, 16]         153,600
     BatchNorm2d-243          [-1, 960, 16, 16]           1,920
            SiLU-244          [-1, 960, 16, 16]               0
          Conv2d-245          [-1, 960, 16, 16]           8,640
     BatchNorm2d-246          [-1, 960, 16, 16]           1,920
            SiLU-247          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-248            [-1, 960, 1, 1]               0
          Conv2d-249             [-1, 40, 1, 1]          38,440
            SiLU-250             [-1, 40, 1, 1]               0
          Conv2d-251            [-1, 960, 1, 1]          39,360
         Sigmoid-252            [-1, 960, 1, 1]               0
SqueezeExcitation-253          [-1, 960, 16, 16]               0
          Conv2d-254          [-1, 160, 16, 16]         153,600
     BatchNorm2d-255          [-1, 160, 16, 16]             320
 StochasticDepth-256          [-1, 160, 16, 16]               0
          MBConv-257          [-1, 160, 16, 16]               0
          Conv2d-258          [-1, 960, 16, 16]         153,600
     BatchNorm2d-259          [-1, 960, 16, 16]           1,920
            SiLU-260          [-1, 960, 16, 16]               0
          Conv2d-261          [-1, 960, 16, 16]           8,640
     BatchNorm2d-262          [-1, 960, 16, 16]           1,920
            SiLU-263          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-264            [-1, 960, 1, 1]               0
          Conv2d-265             [-1, 40, 1, 1]          38,440
            SiLU-266             [-1, 40, 1, 1]               0
          Conv2d-267            [-1, 960, 1, 1]          39,360
         Sigmoid-268            [-1, 960, 1, 1]               0
SqueezeExcitation-269          [-1, 960, 16, 16]               0
          Conv2d-270          [-1, 160, 16, 16]         153,600
     BatchNorm2d-271          [-1, 160, 16, 16]             320
 StochasticDepth-272          [-1, 160, 16, 16]               0
          MBConv-273          [-1, 160, 16, 16]               0
          Conv2d-274          [-1, 960, 16, 16]         153,600
     BatchNorm2d-275          [-1, 960, 16, 16]           1,920
            SiLU-276          [-1, 960, 16, 16]               0
          Conv2d-277          [-1, 960, 16, 16]           8,640
     BatchNorm2d-278          [-1, 960, 16, 16]           1,920
            SiLU-279          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-280            [-1, 960, 1, 1]               0
          Conv2d-281             [-1, 40, 1, 1]          38,440
            SiLU-282             [-1, 40, 1, 1]               0
          Conv2d-283            [-1, 960, 1, 1]          39,360
         Sigmoid-284            [-1, 960, 1, 1]               0
SqueezeExcitation-285          [-1, 960, 16, 16]               0
          Conv2d-286          [-1, 160, 16, 16]         153,600
     BatchNorm2d-287          [-1, 160, 16, 16]             320
 StochasticDepth-288          [-1, 160, 16, 16]               0
          MBConv-289          [-1, 160, 16, 16]               0
          Conv2d-290          [-1, 960, 16, 16]         153,600
     BatchNorm2d-291          [-1, 960, 16, 16]           1,920
            SiLU-292          [-1, 960, 16, 16]               0
          Conv2d-293          [-1, 960, 16, 16]           8,640
     BatchNorm2d-294          [-1, 960, 16, 16]           1,920
            SiLU-295          [-1, 960, 16, 16]               0
AdaptiveAvgPool2d-296            [-1, 960, 1, 1]               0
          Conv2d-297             [-1, 40, 1, 1]          38,440
            SiLU-298             [-1, 40, 1, 1]               0
          Conv2d-299            [-1, 960, 1, 1]          39,360
         Sigmoid-300            [-1, 960, 1, 1]               0
SqueezeExcitation-301          [-1, 960, 16, 16]               0
          Conv2d-302          [-1, 160, 16, 16]         153,600
     BatchNorm2d-303          [-1, 160, 16, 16]             320
 StochasticDepth-304          [-1, 160, 16, 16]               0
          MBConv-305          [-1, 160, 16, 16]               0
          Conv2d-306          [-1, 960, 16, 16]         153,600
     BatchNorm2d-307          [-1, 960, 16, 16]           1,920
            SiLU-308          [-1, 960, 16, 16]               0
          Conv2d-309            [-1, 960, 8, 8]           8,640
     BatchNorm2d-310            [-1, 960, 8, 8]           1,920
            SiLU-311            [-1, 960, 8, 8]               0
AdaptiveAvgPool2d-312            [-1, 960, 1, 1]               0
          Conv2d-313             [-1, 40, 1, 1]          38,440
            SiLU-314             [-1, 40, 1, 1]               0
          Conv2d-315            [-1, 960, 1, 1]          39,360
         Sigmoid-316            [-1, 960, 1, 1]               0
SqueezeExcitation-317            [-1, 960, 8, 8]               0
          Conv2d-318            [-1, 256, 8, 8]         245,760
     BatchNorm2d-319            [-1, 256, 8, 8]             512
          MBConv-320            [-1, 256, 8, 8]               0
          Conv2d-321           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-322           [-1, 1536, 8, 8]           3,072
            SiLU-323           [-1, 1536, 8, 8]               0
          Conv2d-324           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-325           [-1, 1536, 8, 8]           3,072
            SiLU-326           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-327           [-1, 1536, 1, 1]               0
          Conv2d-328             [-1, 64, 1, 1]          98,368
            SiLU-329             [-1, 64, 1, 1]               0
          Conv2d-330           [-1, 1536, 1, 1]          99,840
         Sigmoid-331           [-1, 1536, 1, 1]               0
SqueezeExcitation-332           [-1, 1536, 8, 8]               0
          Conv2d-333            [-1, 256, 8, 8]         393,216
     BatchNorm2d-334            [-1, 256, 8, 8]             512
 StochasticDepth-335            [-1, 256, 8, 8]               0
          MBConv-336            [-1, 256, 8, 8]               0
          Conv2d-337           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-338           [-1, 1536, 8, 8]           3,072
            SiLU-339           [-1, 1536, 8, 8]               0
          Conv2d-340           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-341           [-1, 1536, 8, 8]           3,072
            SiLU-342           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-343           [-1, 1536, 1, 1]               0
          Conv2d-344             [-1, 64, 1, 1]          98,368
            SiLU-345             [-1, 64, 1, 1]               0
          Conv2d-346           [-1, 1536, 1, 1]          99,840
         Sigmoid-347           [-1, 1536, 1, 1]               0
SqueezeExcitation-348           [-1, 1536, 8, 8]               0
          Conv2d-349            [-1, 256, 8, 8]         393,216
     BatchNorm2d-350            [-1, 256, 8, 8]             512
 StochasticDepth-351            [-1, 256, 8, 8]               0
          MBConv-352            [-1, 256, 8, 8]               0
          Conv2d-353           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-354           [-1, 1536, 8, 8]           3,072
            SiLU-355           [-1, 1536, 8, 8]               0
          Conv2d-356           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-357           [-1, 1536, 8, 8]           3,072
            SiLU-358           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-359           [-1, 1536, 1, 1]               0
          Conv2d-360             [-1, 64, 1, 1]          98,368
            SiLU-361             [-1, 64, 1, 1]               0
          Conv2d-362           [-1, 1536, 1, 1]          99,840
         Sigmoid-363           [-1, 1536, 1, 1]               0
SqueezeExcitation-364           [-1, 1536, 8, 8]               0
          Conv2d-365            [-1, 256, 8, 8]         393,216
     BatchNorm2d-366            [-1, 256, 8, 8]             512
 StochasticDepth-367            [-1, 256, 8, 8]               0
          MBConv-368            [-1, 256, 8, 8]               0
          Conv2d-369           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-370           [-1, 1536, 8, 8]           3,072
            SiLU-371           [-1, 1536, 8, 8]               0
          Conv2d-372           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-373           [-1, 1536, 8, 8]           3,072
            SiLU-374           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-375           [-1, 1536, 1, 1]               0
          Conv2d-376             [-1, 64, 1, 1]          98,368
            SiLU-377             [-1, 64, 1, 1]               0
          Conv2d-378           [-1, 1536, 1, 1]          99,840
         Sigmoid-379           [-1, 1536, 1, 1]               0
SqueezeExcitation-380           [-1, 1536, 8, 8]               0
          Conv2d-381            [-1, 256, 8, 8]         393,216
     BatchNorm2d-382            [-1, 256, 8, 8]             512
 StochasticDepth-383            [-1, 256, 8, 8]               0
          MBConv-384            [-1, 256, 8, 8]               0
          Conv2d-385           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-386           [-1, 1536, 8, 8]           3,072
            SiLU-387           [-1, 1536, 8, 8]               0
          Conv2d-388           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-389           [-1, 1536, 8, 8]           3,072
            SiLU-390           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-391           [-1, 1536, 1, 1]               0
          Conv2d-392             [-1, 64, 1, 1]          98,368
            SiLU-393             [-1, 64, 1, 1]               0
          Conv2d-394           [-1, 1536, 1, 1]          99,840
         Sigmoid-395           [-1, 1536, 1, 1]               0
SqueezeExcitation-396           [-1, 1536, 8, 8]               0
          Conv2d-397            [-1, 256, 8, 8]         393,216
     BatchNorm2d-398            [-1, 256, 8, 8]             512
 StochasticDepth-399            [-1, 256, 8, 8]               0
          MBConv-400            [-1, 256, 8, 8]               0
          Conv2d-401           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-402           [-1, 1536, 8, 8]           3,072
            SiLU-403           [-1, 1536, 8, 8]               0
          Conv2d-404           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-405           [-1, 1536, 8, 8]           3,072
            SiLU-406           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-407           [-1, 1536, 1, 1]               0
          Conv2d-408             [-1, 64, 1, 1]          98,368
            SiLU-409             [-1, 64, 1, 1]               0
          Conv2d-410           [-1, 1536, 1, 1]          99,840
         Sigmoid-411           [-1, 1536, 1, 1]               0
SqueezeExcitation-412           [-1, 1536, 8, 8]               0
          Conv2d-413            [-1, 256, 8, 8]         393,216
     BatchNorm2d-414            [-1, 256, 8, 8]             512
 StochasticDepth-415            [-1, 256, 8, 8]               0
          MBConv-416            [-1, 256, 8, 8]               0
          Conv2d-417           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-418           [-1, 1536, 8, 8]           3,072
            SiLU-419           [-1, 1536, 8, 8]               0
          Conv2d-420           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-421           [-1, 1536, 8, 8]           3,072
            SiLU-422           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-423           [-1, 1536, 1, 1]               0
          Conv2d-424             [-1, 64, 1, 1]          98,368
            SiLU-425             [-1, 64, 1, 1]               0
          Conv2d-426           [-1, 1536, 1, 1]          99,840
         Sigmoid-427           [-1, 1536, 1, 1]               0
SqueezeExcitation-428           [-1, 1536, 8, 8]               0
          Conv2d-429            [-1, 256, 8, 8]         393,216
     BatchNorm2d-430            [-1, 256, 8, 8]             512
 StochasticDepth-431            [-1, 256, 8, 8]               0
          MBConv-432            [-1, 256, 8, 8]               0
          Conv2d-433           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-434           [-1, 1536, 8, 8]           3,072
            SiLU-435           [-1, 1536, 8, 8]               0
          Conv2d-436           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-437           [-1, 1536, 8, 8]           3,072
            SiLU-438           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-439           [-1, 1536, 1, 1]               0
          Conv2d-440             [-1, 64, 1, 1]          98,368
            SiLU-441             [-1, 64, 1, 1]               0
          Conv2d-442           [-1, 1536, 1, 1]          99,840
         Sigmoid-443           [-1, 1536, 1, 1]               0
SqueezeExcitation-444           [-1, 1536, 8, 8]               0
          Conv2d-445            [-1, 256, 8, 8]         393,216
     BatchNorm2d-446            [-1, 256, 8, 8]             512
 StochasticDepth-447            [-1, 256, 8, 8]               0
          MBConv-448            [-1, 256, 8, 8]               0
          Conv2d-449           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-450           [-1, 1536, 8, 8]           3,072
            SiLU-451           [-1, 1536, 8, 8]               0
          Conv2d-452           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-453           [-1, 1536, 8, 8]           3,072
            SiLU-454           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-455           [-1, 1536, 1, 1]               0
          Conv2d-456             [-1, 64, 1, 1]          98,368
            SiLU-457             [-1, 64, 1, 1]               0
          Conv2d-458           [-1, 1536, 1, 1]          99,840
         Sigmoid-459           [-1, 1536, 1, 1]               0
SqueezeExcitation-460           [-1, 1536, 8, 8]               0
          Conv2d-461            [-1, 256, 8, 8]         393,216
     BatchNorm2d-462            [-1, 256, 8, 8]             512
 StochasticDepth-463            [-1, 256, 8, 8]               0
          MBConv-464            [-1, 256, 8, 8]               0
          Conv2d-465           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-466           [-1, 1536, 8, 8]           3,072
            SiLU-467           [-1, 1536, 8, 8]               0
          Conv2d-468           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-469           [-1, 1536, 8, 8]           3,072
            SiLU-470           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-471           [-1, 1536, 1, 1]               0
          Conv2d-472             [-1, 64, 1, 1]          98,368
            SiLU-473             [-1, 64, 1, 1]               0
          Conv2d-474           [-1, 1536, 1, 1]          99,840
         Sigmoid-475           [-1, 1536, 1, 1]               0
SqueezeExcitation-476           [-1, 1536, 8, 8]               0
          Conv2d-477            [-1, 256, 8, 8]         393,216
     BatchNorm2d-478            [-1, 256, 8, 8]             512
 StochasticDepth-479            [-1, 256, 8, 8]               0
          MBConv-480            [-1, 256, 8, 8]               0
          Conv2d-481           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-482           [-1, 1536, 8, 8]           3,072
            SiLU-483           [-1, 1536, 8, 8]               0
          Conv2d-484           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-485           [-1, 1536, 8, 8]           3,072
            SiLU-486           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-487           [-1, 1536, 1, 1]               0
          Conv2d-488             [-1, 64, 1, 1]          98,368
            SiLU-489             [-1, 64, 1, 1]               0
          Conv2d-490           [-1, 1536, 1, 1]          99,840
         Sigmoid-491           [-1, 1536, 1, 1]               0
SqueezeExcitation-492           [-1, 1536, 8, 8]               0
          Conv2d-493            [-1, 256, 8, 8]         393,216
     BatchNorm2d-494            [-1, 256, 8, 8]             512
 StochasticDepth-495            [-1, 256, 8, 8]               0
          MBConv-496            [-1, 256, 8, 8]               0
          Conv2d-497           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-498           [-1, 1536, 8, 8]           3,072
            SiLU-499           [-1, 1536, 8, 8]               0
          Conv2d-500           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-501           [-1, 1536, 8, 8]           3,072
            SiLU-502           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-503           [-1, 1536, 1, 1]               0
          Conv2d-504             [-1, 64, 1, 1]          98,368
            SiLU-505             [-1, 64, 1, 1]               0
          Conv2d-506           [-1, 1536, 1, 1]          99,840
         Sigmoid-507           [-1, 1536, 1, 1]               0
SqueezeExcitation-508           [-1, 1536, 8, 8]               0
          Conv2d-509            [-1, 256, 8, 8]         393,216
     BatchNorm2d-510            [-1, 256, 8, 8]             512
 StochasticDepth-511            [-1, 256, 8, 8]               0
          MBConv-512            [-1, 256, 8, 8]               0
          Conv2d-513           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-514           [-1, 1536, 8, 8]           3,072
            SiLU-515           [-1, 1536, 8, 8]               0
          Conv2d-516           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-517           [-1, 1536, 8, 8]           3,072
            SiLU-518           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-519           [-1, 1536, 1, 1]               0
          Conv2d-520             [-1, 64, 1, 1]          98,368
            SiLU-521             [-1, 64, 1, 1]               0
          Conv2d-522           [-1, 1536, 1, 1]          99,840
         Sigmoid-523           [-1, 1536, 1, 1]               0
SqueezeExcitation-524           [-1, 1536, 8, 8]               0
          Conv2d-525            [-1, 256, 8, 8]         393,216
     BatchNorm2d-526            [-1, 256, 8, 8]             512
 StochasticDepth-527            [-1, 256, 8, 8]               0
          MBConv-528            [-1, 256, 8, 8]               0
          Conv2d-529           [-1, 1536, 8, 8]         393,216
     BatchNorm2d-530           [-1, 1536, 8, 8]           3,072
            SiLU-531           [-1, 1536, 8, 8]               0
          Conv2d-532           [-1, 1536, 8, 8]          13,824
     BatchNorm2d-533           [-1, 1536, 8, 8]           3,072
            SiLU-534           [-1, 1536, 8, 8]               0
AdaptiveAvgPool2d-535           [-1, 1536, 1, 1]               0
          Conv2d-536             [-1, 64, 1, 1]          98,368
            SiLU-537             [-1, 64, 1, 1]               0
          Conv2d-538           [-1, 1536, 1, 1]          99,840
         Sigmoid-539           [-1, 1536, 1, 1]               0
SqueezeExcitation-540           [-1, 1536, 8, 8]               0
          Conv2d-541            [-1, 256, 8, 8]         393,216
     BatchNorm2d-542            [-1, 256, 8, 8]             512
 StochasticDepth-543            [-1, 256, 8, 8]               0
          MBConv-544            [-1, 256, 8, 8]               0
          Conv2d-545           [-1, 1280, 8, 8]         327,680
     BatchNorm2d-546           [-1, 1280, 8, 8]           2,560
            SiLU-547           [-1, 1280, 8, 8]               0
AdaptiveAvgPool2d-548           [-1, 1280, 1, 1]               0
         Dropout-549                 [-1, 1280]               0
          Linear-550                   [-1, 47]          60,207
================================================================
Total params: 20,237,695
Trainable params: 20,237,695
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 420.75
Params size (MB): 77.20
Estimated Total Size (MB): 498.70
----------------------------------------------------------------
Avg. loss: 3.848
Accuracy: 0.040
F1 score: 0.003
Recall: 0.040
Precision: 0.002

[Epoch: 1/20, Iter:   94/94] batch loss: 3.939 total loss: 3.973
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 7.441
Accuracy: 0.034
F1 score: 0.004
Recall: 0.034
Precision: 0.002

[Epoch: 2/20, Iter:   94/94] batch loss: 3.826 total loss: 3.876
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 4.360
Accuracy: 0.034
F1 score: 0.015
Recall: 0.034
Precision: 0.016

[Epoch: 3/20, Iter:   94/94] batch loss: 3.924 total loss: 3.870
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.852
Accuracy: 0.023
F1 score: 0.010
Recall: 0.023
Precision: 0.010

[Epoch: 4/20, Iter:   94/94] batch loss: 4.037 total loss: 3.854
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.845
Accuracy: 0.017
F1 score: 0.001
Recall: 0.017
Precision: 0.001

[Epoch: 5/20, Iter:   94/94] batch loss: 3.823 total loss: 3.858
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 5.174
Accuracy: 0.028
F1 score: 0.006
Recall: 0.028
Precision: 0.004

[Epoch: 6/20, Iter:   94/94] batch loss: 3.970 total loss: 3.841
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.893
Accuracy: 0.034
F1 score: 0.005
Recall: 0.034
Precision: 0.003

[Epoch: 7/20, Iter:   94/94] batch loss: 3.691 total loss: 3.812
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 4.001
Accuracy: 0.017
F1 score: 0.005
Recall: 0.017
Precision: 0.003

[Epoch: 8/20, Iter:   94/94] batch loss: 3.755 total loss: 3.813
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.818
Accuracy: 0.034
F1 score: 0.014
Recall: 0.034
Precision: 0.031

[Epoch: 9/20, Iter:   94/94] batch loss: 3.877 total loss: 3.782
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.986
Accuracy: 0.034
F1 score: 0.009
Recall: 0.034
Precision: 0.005

[Epoch: 10/20, Iter:   94/94] batch loss: 3.638 total loss: 3.772
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.803
Accuracy: 0.045
F1 score: 0.009
Recall: 0.045
Precision: 0.005

[Epoch: 11/20, Iter:   94/94] batch loss: 3.698 total loss: 3.752
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.856
Accuracy: 0.028
F1 score: 0.009
Recall: 0.028
Precision: 0.005

[Epoch: 12/20, Iter:   94/94] batch loss: 3.437 total loss: 3.731
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.824
Accuracy: 0.034
F1 score: 0.015
Recall: 0.034
Precision: 0.012

[Epoch: 13/20, Iter:   94/94] batch loss: 3.629 total loss: 3.712
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.770
Accuracy: 0.074
F1 score: 0.041
Recall: 0.074
Precision: 0.041

[Epoch: 14/20, Iter:   94/94] batch loss: 3.728 total loss: 3.691
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.832
Accuracy: 0.034
F1 score: 0.012
Recall: 0.034
Precision: 0.008

[Epoch: 15/20, Iter:   94/94] batch loss: 3.855 total loss: 3.678
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.765
Accuracy: 0.051
F1 score: 0.019
Recall: 0.051
Precision: 0.014

[Epoch: 16/20, Iter:   94/94] batch loss: 3.791 total loss: 3.667
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.767
Accuracy: 0.028
F1 score: 0.014
Recall: 0.028
Precision: 0.023

[Epoch: 17/20, Iter:   94/94] batch loss: 3.718 total loss: 3.657
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.795
Accuracy: 0.034
F1 score: 0.011
Recall: 0.034
Precision: 0.007

[Epoch: 18/20, Iter:   94/94] batch loss: 3.708 total loss: 3.655
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.733
Accuracy: 0.051
F1 score: 0.021
Recall: 0.051
Precision: 0.017

[Epoch: 19/20, Iter:   94/94] batch loss: 3.677 total loss: 3.642
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.730
Accuracy: 0.062
F1 score: 0.024
Recall: 0.062
Precision: 0.017

[Epoch: 20/20, Iter:   94/94] batch loss: 3.572 total loss: 3.619
----------------------------------------------------------------------------------------------------
Validating model...
Avg. loss: 3.802
Accuracy: 0.062
F1 score: 0.019
Recall: 0.062
Precision: 0.012

----------------------------------------------------------------------------------------------------
Testing model...
Avg. loss: 3.752
Accuracy: 0.068
F1 score: 0.031
Recall: 0.068
Precision: 0.021
